LiuChao003/OpenART-Project/bsp/imxrt/libraries/drivers/usb/omv_app/drv_usb_omv.c
/*
 * This file is part of the Micro Python project, http://micropython.org/
 *
 * The MIT License (MIT)
 *
 * Copyright (c) 2013, 2014, 2015 Damien P. George
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 * THE SOFTWARE.
 */
#include "fsl_device_registers.h"

#include <stdio.h>
#include <stdlib.h>

#include "usb_device_config.h"
#include "usb.h"
#include "usb_device.h"

#include "usb_device_class.h"
#include "usb_device_config.h"
#if USB_DEVICE_CONFIG_CDC_ACM
#include "usb_device_cdc_acm.h"
#endif

#include "py/objstr.h"
#include "py/runtime.h"
#include "py/stream.h"
#include "py/mperrno.h"
#include "py/mphal.h"
#include "composite.h"
#include "drv_usb_omv.h"
#include "bufhelper.h"

mp_uint_t pyb_usb_flags = 0;
#ifdef USE_DEVICE_MODE
pyb_usb_storage_medium_t pyb_usb_storage_medium = PYB_USB_STORAGE_MEDIUM_NONE;
#endif


// predefined hid mouse data
STATIC const mp_obj_str_t pyb_usb_hid_mouse_desc_obj = {
    {&mp_type_bytes},
    0, // hash not valid
    0, //USBD_HID_MOUSE_REPORT_DESC_SIZE,
    0, //USBD_HID_MOUSE_ReportDesc,
};
const mp_obj_tuple_t pyb_usb_hid_mouse_obj = {
    {&mp_type_tuple},
    5,
    {
        MP_OBJ_NEW_SMALL_INT(1), // subclass: boot
        MP_OBJ_NEW_SMALL_INT(2), // protocol: mouse
        MP_OBJ_NEW_SMALL_INT(FS_HID_MOUSE_INTERRUPT_IN_PACKET_SIZE),
        MP_OBJ_NEW_SMALL_INT(8), // polling interval: 8ms
        (mp_obj_t)&pyb_usb_hid_mouse_desc_obj,
    },
};

// predefined hid keyboard data
STATIC const mp_obj_str_t pyb_usb_hid_keyboard_desc_obj = {
    {&mp_type_bytes},
    0, // hash not valid
    0, // USBD_HID_KEYBOARD_REPORT_DESC_SIZE,
    0, // USBD_HID_KEYBOARD_ReportDesc,
};
const mp_obj_tuple_t pyb_usb_hid_keyboard_obj = {
    {&mp_type_tuple},
    5,
    {
        MP_OBJ_NEW_SMALL_INT(1), // subclass: boot
        MP_OBJ_NEW_SMALL_INT(1), // protocol: keyboard
        MP_OBJ_NEW_SMALL_INT(FS_HID_KEYBOARD_INTERRUPT_IN_PACKET_SIZE),
        MP_OBJ_NEW_SMALL_INT(8), // polling interval: 8ms
        (mp_obj_t)&pyb_usb_hid_keyboard_desc_obj,
    },
};

void pyb_usb_init0(void) {
    mp_hal_set_interrupt_char(-1);
    MP_STATE_PORT(pyb_hid_report_desc) = MP_OBJ_NULL;
}


bool pyb_usb_dev_init(uint16_t vid, uint16_t pid, usb_device_mode_t mode, USBD_HID_ModeInfoTypeDef *hid_info) {
#ifdef USE_DEVICE_MODE
    if (!(pyb_usb_flags & PYB_USB_FLAG_DEV_ENABLED)) {
        // only init USB once in the device's power-lifetime
        USBD_SetVIDPIDRelease(vid, pid, 0x0200, mode == USBD_MODE_CDC);
        if (USBD_SelectMode(mode, hid_info) < 0) {
            return false;
        }
        USBAPP_Init();
    }
    pyb_usb_flags |= PYB_USB_FLAG_DEV_ENABLED;
#endif

    return true;
}

void pyb_usb_dev_deinit(void) {
    if (pyb_usb_flags & PYB_USB_FLAG_DEV_ENABLED) {
        USBAPP_Deinit();
        pyb_usb_flags &= ~PYB_USB_FLAG_DEV_ENABLED;
    }
}

__WEAK bool IsVcpOccupiedByOpenMvIDE(void) {
	return 0;
}

bool usb_vcp_is_enabled(void) {
	// if (IsVcpOccupiedByOpenMvIDE())
	//	return 0;
    return (pyb_usb_flags & PYB_USB_FLAG_DEV_ENABLED) != 0;
}

int usb_vcp_recv_byte(uint8_t *c) {
    return VCOM_Read(c, 1, 0);
}

void usb_vcp_send_strn(const char *str, int len) {
#ifdef USE_DEVICE_MODE
	if (VCOM_OmvIsIdeConnecting())
		return;	
	bool omvUsbDbg = VCOM_OmvIsIdeConnected();
    if (pyb_usb_flags & PYB_USB_FLAG_DEV_ENABLED) {
		if (omvUsbDbg) {
			VCOM_OmvWriteAlways((const uint8_t*)str, len);
		} else {
			VCOM_WriteAlways((const uint8_t*)str, len);
		} 		
    }
#endif
}

void usb_vcp_send_strn_cooked(const char *str, int len) {
#ifdef USE_DEVICE_MODE
	if (VCOM_OmvIsIdeConnecting())
		return;
	bool omvUsbDbg = VCOM_OmvIsIdeConnected();
    if (pyb_usb_flags & PYB_USB_FLAG_DEV_ENABLED) {
        for (const char *top = str + len; str < top; str++) {
            if (*str == '\n') {
				if (!omvUsbDbg) {
                	VCOM_WriteAlways((const uint8_t*)"\r\n", 2);
				} else {
					VCOM_OmvWriteAlways((const uint8_t*)"\r\n", 2);
				}
            } else {
				if (!omvUsbDbg) {
                	VCOM_WriteAlways((const uint8_t*)str, 1);
				} else {
					VCOM_OmvWriteAlways((const uint8_t*)str, 1);
				}            
            }
        }
    }
#endif
}

/******************************************************************************/
// Micro Python bindings for USB

/*
  Philosophy of USB driver and Python API: pyb.usb_mode(...) configures the USB
  on the board.  The USB itself is not an entity, rather the interfaces are, and
  can be accessed by creating objects, such as pyb.USB_VCP() and pyb.USB_HID().

  We have:

    pyb.usb_mode()          # return the current usb mode
    pyb.usb_mode(None)      # disable USB
    pyb.usb_mode('VCP')     # enable with VCP interface
    pyb.usb_mode('VCP+MSC') # enable with VCP and MSC interfaces
    pyb.usb_mode('VCP+HID') # enable with VCP and HID, defaulting to mouse protocol
    pyb.usb_mode('VCP+HID', vid=0xf055, pid=0x9800) # specify VID and PID
    pyb.usb_mode('VCP+HID', hid=pyb.hid_mouse)
    pyb.usb_mode('VCP+HID', hid=pyb.hid_keyboard)
    pyb.usb_mode('VCP+HID', pid=0x1234, hid=(subclass, protocol, max_packet_len, polling_interval, report_desc))

