LiuChao003/OpenART-Project/bsp/imxrt/libraries/drivers/usb/omv_app/drv_usb_omv.c
    // get the buffer to receive into
    vstr_t vstr;
    mp_obj_t o_ret = pyb_buf_get_for_recv(vals[0].u_obj, &vstr);

    // receive the data
    int ret = 0; 
	// rocky ignore
	// ret = USBD_HID_Rx(&hUSBDDevice, (uint8_t*)vstr.buf, vstr.len, vals[1].u_int);

    // return the received data
    if (o_ret != MP_OBJ_NULL) {
        return mp_obj_new_int(ret); // number of bytes read into given buffer
    } else {
        vstr.len = ret; // set actual number of bytes read
        return mp_obj_new_str_from_vstr(&mp_type_bytes, &vstr); // create a new buffer
    }
}
STATIC MP_DEFINE_CONST_FUN_OBJ_KW(pyb_usb_hid_recv_obj, 1, pyb_usb_hid_recv);

STATIC mp_obj_t pyb_usb_hid_send(mp_obj_t self_in, mp_obj_t report_in) {
#ifdef USE_DEVICE_MODE
    mp_buffer_info_t bufinfo;
    byte temp_buf[8];
    // get the buffer to send from
    // we accept either a byte array, or a tuple/list of integers
    if (!mp_get_buffer(report_in, &bufinfo, MP_BUFFER_READ)) {
        mp_obj_t *items;
        mp_obj_get_array(report_in, &bufinfo.len, &items);
        if (bufinfo.len > sizeof(temp_buf)) {
            nlr_raise(mp_obj_new_exception_msg(&mp_type_ValueError, "tuple/list too large for HID report; use bytearray instead"));
        }
        for (int i = 0; i < bufinfo.len; i++) {
            temp_buf[i] = mp_obj_get_int(items[i]);
        }
        bufinfo.buf = temp_buf;
    }

    // send the data
	/* >>> rocky ignore
    if (USBD_OK == USBD_HID_SendReport(&hUSBDDevice, bufinfo.buf, bufinfo.len)) {
        return mp_obj_new_int(bufinfo.len);
    } else {
        return mp_obj_new_int(0);
    }
	*/
	return mp_obj_new_int(0);
#else
	return mp_const_none;
#endif

    
}
STATIC MP_DEFINE_CONST_FUN_OBJ_2(pyb_usb_hid_send_obj, pyb_usb_hid_send);

// deprecated in favour of USB_HID.send
STATIC mp_obj_t pyb_hid_send_report(mp_obj_t arg) {
    return pyb_usb_hid_send(MP_OBJ_NULL, arg);
}
MP_DEFINE_CONST_FUN_OBJ_1(pyb_hid_send_report_obj, pyb_hid_send_report);

STATIC const mp_rom_map_elem_t pyb_usb_hid_locals_dict_table[] = {
    { MP_ROM_QSTR(MP_QSTR_send), MP_ROM_PTR(&pyb_usb_hid_send_obj) },
    { MP_ROM_QSTR(MP_QSTR_recv), MP_ROM_PTR(&pyb_usb_hid_recv_obj) },
};

STATIC MP_DEFINE_CONST_DICT(pyb_usb_hid_locals_dict, pyb_usb_hid_locals_dict_table);

STATIC mp_uint_t pyb_usb_hid_ioctl(mp_obj_t self_in, mp_uint_t request, mp_uint_t arg, int *errcode) {
    mp_uint_t ret = 0;
	/* rocky ignore
    if (request == MP_STREAM_POLL) {
        mp_uint_t flags = arg;
        ret = 0;
        if ((flags & MP_STREAM_POLL_RD) && USBD_HID_RxNum() > 0) {
            ret |= MP_STREAM_POLL_RD;
        }
        if ((flags & MP_STREAM_POLL_WR) && USBD_HID_CanSendReport(&hUSBDDevice)) {
            ret |= MP_STREAM_POLL_WR;
        }
    } else {
        *errcode = MP_EINVAL;
        ret = MP_STREAM_ERROR;
    }
	*/
    return ret;
}

STATIC const mp_stream_p_t pyb_usb_hid_stream_p = {
    .ioctl = pyb_usb_hid_ioctl,
};

const mp_obj_type_t pyb_usb_hid_type = {
    { &mp_type_type },
    .name = MP_QSTR_USB_HID,
    .make_new = pyb_usb_hid_make_new,
    .protocol = &pyb_usb_hid_stream_p,
    .locals_dict = (mp_obj_dict_t*)&pyb_usb_hid_locals_dict,
};

usb_osa_status_t USB_OsaMutexCreate(usb_osa_mutex_handle *handle)
{
	*handle = rt_mutex_create("usbMut",0);
	if(handle == RT_NULL)
		return kStatus_USB_OSA_Error;
	else
		return kStatus_USB_OSA_Success;
}

usb_osa_status_t USB_OsaMutexDestroy(usb_osa_mutex_handle handle)
{
	rt_mutex_delete(handle);
    return kStatus_USB_OSA_Success;
}
usb_osa_status_t USB_OsaMutexLock(usb_osa_mutex_handle handle)
{
	rt_mutex_take(handle,RT_WAITING_FOREVER);
    return kStatus_USB_OSA_Success;
}
usb_osa_status_t USB_OsaMutexUnlock(usb_osa_mutex_handle handle)
{
	rt_mutex_release(handle);
    return kStatus_USB_OSA_Success;
}

rt_thread_t usb_tid;
static rt_sem_t usb_sem = RT_NULL;
void usb_thread_entry(void *parameter)
{
	while(1)
	{
		//disable usb int
		rt_sem_take(usb_sem, RT_WAITING_FOREVER);
		
		NVIC_DisableIRQ(USB_OTG1_IRQn);
		__DSB(); __ISB();
		
		USBAPP_IRQHandler();
		
		NVIC_EnableIRQ(USB_OTG1_IRQn);
		__DSB(); __ISB();
	}
}

void USBAPP_ResumeThread()
{
	rt_sem_release(usb_sem);
	rt_schedule();
	NVIC_DisableIRQ(USB_OTG1_IRQn);
	__DSB(); __ISB();
}

void USBAPP_StartThread()
{
	rt_err_t result;
	
	usb_sem = rt_sem_create("usb", 0, RT_IPC_FLAG_FIFO);

    usb_tid = rt_thread_create("usb", usb_thread_entry, RT_NULL,
                            RT_MAIN_THREAD_STACK_SIZE, RT_MAIN_THREAD_PRIORITY-6, 20);
    RT_ASSERT(usb_tid != RT_NULL);
	rt_thread_startup(usb_tid);
	rt_thread_suspend(usb_tid);
}

void USBAPP_DestroyThread()
{
	rt_sem_delete(usb_sem);
	rt_thread_delete(usb_tid);
}

void usb_msc()
{
	pyb_usb_dev_init(USBD_VID, USBD_PID_CDC_MSC, USBD_MODE_CDC_MSC, NULL);
}
//INIT_APP_EXPORT(usb_app);
MSH_CMD_EXPORT(usb_msc, USB: USB CDC MSC init);
